[Agentic-Smar-Community] Refactor user guide (#3504)
